Revit 2027 API
ScheduleDefinition.CanHaveEmbeddedSchedule Method
 Indicates if this ScheduleDefinition can have an embedded ScheduleDefinition added.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanHaveEmbeddedSchedule()
Public Function CanHaveEmbeddedSchedule As Boolean
public:
bool CanHaveEmbeddedSchedule()
member CanHaveEmbeddedSchedule : unit -> bool
Return Value
Boolean
 True if this ScheduleDefinition can have an embedded ScheduleDefinition, false otherwise.
Remarks
Only schedules of the following categories can have an embedded ScheduleDefinition:
Rooms
Spaces
Electrical Circuits
Duct Systems
Piping Systems
Mechanical Equipment Sets
MEP Fabrication Ductwork
Fabrication Ductwork Stiffeners
Key schedules cannot have embedded schedules.
See Also
Reference
ScheduleDefinition Class
Autodesk.Revit.DB Namespace